{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting five requirements (REQ-33 through REQ-37) for implementing OCR-based image upload functionality in BattleCalculatorForm, including removing placeholder text, connecting upload buttons to extractScoutFromImage, and auto-populating form fields from extracted scout data.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including the battle calculation engine, OCR utilities, form components, validation logic, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for background, foreground, cards, borders, and tactical UI elements.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Kingshot Battle Calculator', and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component with ErrorBoundary, ThemeProvider, QueryClientProvider, tactical military-themed header with Shield icon, BattleCalculatorForm main content, and footer with caffeine.ai attribution and UTM tracking.",
  "frontend/src/components/BattleCalculatorForm.tsx": "Main battle calculator form component with comprehensive state management for scout paste, manual enemy entry, tier/TG selection, battle configuration, OCR image upload handlers (handleEnemyImageUpload and handleMyImageUpload) with separate loading states, auto-population of form fields from extracted data, validation, and calculation flow.",
  "frontend/src/components/BattleResults.tsx": "Results display component showing win probability with color-coded badges and progress bar, recommended formation breakdown with percentages and troop counts in a three-column grid, total march size used, and required march size to achieve target win rate when applicable.",
  "frontend/src/components/FormField.tsx": "Reusable form field wrapper component that renders a label with optional HelpTooltip, children input elements, and inline error messages with consistent spacing and styling.",
  "frontend/src/components/HelpTooltip.tsx": "React component that renders an info icon with a tooltip displaying a title and content, using lucide-react icons and shadcn/ui tooltip components.",
  "frontend/src/constants/helpText.ts": "Exports HELP_TEXT object containing help documentation for various features including scout paste format, counter mechanics, RNG skills, special bonuses, battle types, tier selection, march size, and target win percentage.",
  "frontend/src/hooks/useActor.ts": "React hook that manages ICP backend actor creation using Internet Identity authentication, automatically recreating the actor when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom tactical dark theme using OKLCH color system, defining CSS variables for colors, borders, and UI components with military-inspired color palette.",
  "frontend/src/lib/kingshotCore.ts": "Core battle simulation engine for Kingshot PvP calculator implementing troop counters, stat bonuses, RNG skills, and Monte Carlo simulations to predict battle outcomes and recommend optimal formations.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for ICP authentication.",
  "frontend/src/utils/canvasUtils.ts": "Canvas manipulation utilities for OCR preprocessing including image loading, region cropping, and grayscale/binary threshold conversion for improved text recognition.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting numbers, percentages, and troop counts with locale-aware number formatting and customizable precision.",
  "frontend/src/utils/ocrExtraction.ts": "OCR extraction utility that lazy-loads tesseract.js from CDN to process scout report images, extracting troop counts, tier (Roman numerals), TG level, and march size from specific canvas regions.",
  "frontend/src/utils/textParsing.ts": "Text parsing utilities for normalizing OCR output and extracting structured data including march size, troop counts (infantry/cavalry/archer), and Roman numeral tier conversion.",
  "frontend/src/utils/validation.ts": "Validation functions for scout paste text, tier, TG, march size, troop composition percentages, and target win rate, plus a loose integer parser that strips non-numeric characters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom tactical/military theme colors (dark tones, olive, steel, amber), extended color system using oklch, custom shadows, and typography/animation plugins.",
  "frontend/tsconfig.node.json": "TypeScript configuration for Vite build tooling with ESNext module resolution and composite project settings.",
  "frontend/vite.config.ts": "Vite configuration with React plugin, environment variable injection for canisters, path aliases, dev server proxy to local backend, and optimized build output with vendor chunking.",
  "project_state.json": "Project state document describing the Kingshot Battle Calculator architecture, Monte Carlo simulation engine, formation optimization, counter mechanics, RNG skills, and known issue with OCR upload buttons showing placeholder instead of triggering extraction."
}