{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting implemented OCR extraction, canvas preprocessing, text parsing utilities, and BattleCalculatorForm integration with high confidence test mappings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including core battle calculation engine, UI components, utilities, and configuration files with detailed feature descriptions.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system for light and dark themes with tactical military color palette and base styling for borders and backgrounds.",
  "frontend/index.html": "HTML entry point with viewport meta tags, page title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component with ErrorBoundary, QueryClientProvider, ThemeProvider, tactical header with Shield icon, BattleCalculatorForm, and footer with caffeine.ai attribution and UTM tracking.",
  "frontend/src/components/BattleCalculatorForm.tsx": "Comprehensive battle calculator form managing scout paste input, manual enemy entry, tier/TG selection, OCR image upload with separate loading states for enemy and player images, validation, and calculation orchestration with error handling.",
  "frontend/src/components/BattleResults.tsx": "Results display component showing win probability with color-coded badges and progress bar, recommended formation breakdown with percentages and troop counts, total march size, and required march size for target win rate.",
  "frontend/src/components/FormField.tsx": "Reusable form field wrapper component rendering label with optional help tooltip, children input element, and inline error message display.",
  "frontend/src/components/HelpTooltip.tsx": "React component that renders an info icon with a tooltip, displaying a title and content text when hovered.",
  "frontend/src/constants/helpText.ts": "Exports help text constants for various game mechanics including scout paste format, counter system, RNG skills, special bonuses, battle types, tier selection, march size, and target win percentage.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom tactical dark theme using OKLCH color system, defining CSS variables for backgrounds, foregrounds, borders, and tactical color utilities.",
  "frontend/src/lib/kingshotCore.ts": "Core battle simulation engine for Kingshot PvP calculator implementing troop mechanics, counter system (Infantry>Cavalry>Archers>Infantry), RNG skills, stat bonuses, and Monte Carlo simulation to calculate win probabilities and recommend formations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/utils/canvasUtils.ts": "Canvas manipulation utilities for OCR preprocessing including functions to load images to canvas, crop regions, and apply grayscale/binary threshold preprocessing.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting numbers, percentages, and troop counts for display in the UI.",
  "frontend/src/utils/ocrExtraction.ts": "Placeholder OCR extraction module for processing scout report images; currently throws an error as tesseract.js is not installed, with instructions for enabling the feature.",
  "frontend/src/utils/textParsing.ts": "Text parsing utilities for OCR scout data: normalizes text, parses numbers, converts Roman numerals to tiers (I-XI → 1-11), and extracts march size and troop counts (infantry/cavalry/archer) using regex patterns.",
  "frontend/src/utils/validation.ts": "Validation functions for scout paste, tier (1-11), TG (0-5), march size, troop composition percentages, and target win percentage; includes parseIntLoose helper for cleaning numeric input.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom tactical/military theme colors (dark tones, olive, steel, amber), OKLCH color system, extended shadows, typography plugin, and container queries support.",
  "frontend/tsconfig.node.json": "TypeScript configuration for Vite build tooling with ESNext module resolution and composite project settings.",
  "frontend/vite.config.ts": "Vite configuration with React plugin, path aliases, dev server on port 3000 with API proxy to localhost:4943, code splitting for React and UI vendors, and environment variable injection for Canister/DFX.",
  "project_state.json": "Project metadata documenting Kingshot Battle Calculator architecture: Monte Carlo simulation engine, formation optimization, counter mechanics, RNG skills, scout parsing, and existing UI features with tactical theme."
}