{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Activate OCR image upload functionality",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Remove 'coming soon' placeholder text from both My Troops and Enemy Troops image upload buttons",
      "acceptanceCriteria": [
        "Upload buttons display actionable text like 'Upload scout image' instead of 'Or upload your scout image (coming soon)'",
        "No placeholder text suggests the feature is unavailable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BattleCalculatorForm.tsx",
          "operation": "modify",
          "description": "Update upload button labels for both My Troops and Enemy Troops sections: change 'Or upload your scout image (coming soon)' to 'Or upload scout image' and 'Or upload enemy scout image (coming soon)' to 'Or upload enemy scout image'. Remove any disabled states or placeholder styling that suggests unavailability."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Remove error alert that displays when users click upload buttons",
      "acceptanceCriteria": [
        "No error alert appears when upload buttons are clicked",
        "Upload buttons trigger file picker instead of showing error messages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BattleCalculatorForm.tsx",
          "operation": "modify",
          "description": "Remove the error alert logic that shows 'Image OCR feature is not yet available. Please paste scout data manually or contact support to enable this feature.' when upload buttons are clicked. Remove any conditional checks that prevent file picker from opening. Ensure both upload buttons immediately trigger file input elements without error messages."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Connect upload buttons to extractScoutFromImage function for immediate image processing",
      "acceptanceCriteria": [
        "Clicking My Troops upload button opens file picker and processes selected image through extractScoutFromImage",
        "Clicking Enemy Troops upload button opens file picker and processes selected image through extractScoutFromImage",
        "Each upload routes extraction results to correct state (myTroops vs enemyTroops) without cross-contamination"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BattleCalculatorForm.tsx",
          "operation": "modify",
          "description": "Wire both My Troops and Enemy Troops upload buttons to the extractScoutFromImage function from ocrExtraction.ts. Implement file input handlers that: (1) accept image files from file picker, (2) call extractScoutFromImage with the selected file, (3) route extraction results to correct state variables (myScoutPaste for My Troops, enemyScoutPaste for Enemy Troops), (4) set separate loading states (isLoadingPlayerImage, isLoadingEnemyImage) during processing, (5) handle extraction success by populating form fields, (6) maintain state isolation between My Troops and Enemy Troops workflows to prevent cross-contamination."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Verify OCR extraction correctly identifies tier (Roman numerals I-XI) and TG level (digits 1-5) from scout report images",
      "acceptanceCriteria": [
        "OCR correctly extracts Roman numeral 'X' from bottom of troop icons and converts to Tier 10",
        "OCR correctly extracts digit '3' from top-right corner of troop icons and identifies as TG Level 3",
        "Tier and TG dropdowns auto-populate with extracted values after image processing",
        "Extraction works for all tier values (I-XI) and TG levels (1-5)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BattleCalculatorForm.tsx",
          "operation": "modify",
          "description": "After extractScoutFromImage returns parsed data, auto-populate tier and TG dropdowns for the appropriate troop section (My Troops or Enemy Troops). Use the existing textParsing utilities that convert Roman numerals (I-XI) to tier values (1-11) and extract TG digits (1-5). Ensure tier dropdown selects the extracted tier value and TG dropdown selects the extracted TG level. Maintain separate tier/TG state for myTroops vs enemyTroops to prevent conflicts."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Ensure complete OCR workflow auto-populates all form fields while keeping them editable",
      "acceptanceCriteria": [
        "Scout paste textarea displays OCR extracted text after image upload",
        "March size field auto-fills from extracted value or troop total sum",
        "Tier and TG dropdowns auto-select based on extracted Roman numerals and digits",
        "Troop count fields (infantry/cavalry/archer) populate with extracted values",
        "All auto-filled fields remain editable for user corrections",
        "Loading state displays during OCR processing"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BattleCalculatorForm.tsx",
          "operation": "modify",
          "description": "Implement comprehensive form auto-population after successful OCR extraction: (1) populate scout paste textarea (myScoutPaste or enemyScoutPaste) with extracted text, (2) auto-fill march size field from extracted value or sum of troop counts, (3) auto-select tier and TG dropdowns based on extracted Roman numerals and digits, (4) populate troop count fields (infantry/cavalry/archer) with extracted values, (5) display loading state (spinner or indicator) using isLoadingPlayerImage or isLoadingEnemyImage during processing, (6) ensure all auto-filled fields remain editable by preserving controlled input state and allowing user modifications after auto-fill."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Display clear, actionable error messages when OCR extraction fails",
      "acceptanceCriteria": [
        "Failed extractions show specific error messages like 'Could not extract scout data. Please ensure the image shows a clear Kingshot scout report with visible troop icons.'",
        "Error messages provide guidance on image quality requirements",
        "Extraction failures do not crash the application or leave UI in broken state"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BattleCalculatorForm.tsx",
          "operation": "modify",
          "description": "Wrap extractScoutFromImage calls in try-catch blocks to handle OCR failures gracefully. Display user-friendly error messages that guide users on image requirements: 'Could not extract scout data. Please ensure the image shows a clear Kingshot scout report with visible troop icons and stat bonuses.' Use existing error state management to show error alerts without crashing the UI. Clear loading states on error. Preserve any partial extraction results and allow users to manually correct or retry with a different image."
        }
      ]
    }
  ]
}